app/controllers/admin/digs_controller.rb

  def index
    @digs = Dig.all
---
SELECT * FROM `digs`

  def edit
    @dig = Dig.find(params[:id])
---
SELECT * FROM `digs` WHERE (`digs`.`id` = 1)