app/controllers/admin/theatres_controller.rb

SELECT * FROM `theatres`
---
  def index
    @theatres = Theatre.all

SELECT * FROM `theatres` WHERE (`theatres`.`id` = 1)
---
  def edit
    @theatre = Theatre.find(params[:id])