app/controllers/admin/tours_controller.rb

SELECT * FROM `tours`
---
  def index
    @tours = Tour.all

INSERT INTO `tours` (`name`, `created_at`, `updated_at`) VALUES('hello', '2010-01-21 19:38:10', '2010-01-21 19:38:10')
---
  def create
    Tour.create!(params[:tour])

SELECT * FROM `tours` WHERE (`tours`.`id` = 4)
---
  def edit
    @tour = Tour.find(params[:id])

SELECT * FROM `tours` WHERE (`tours`.`id` = 1)
UPDATE `tours` SET `updated_at` = '2010-01-21 23:00:50', `name` = 'Test1' WHERE `id` = 1
---
  def update
    Tour.find(params[:id]).update_attributes(params[:tour])